Sub Queries

In [3]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost

In [4]:
%%sql
create database if not exists tutorial;
use tutorial;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.
0 rows affected.

[]

In [52]:
%%sql
drop table if exists orders;
create table orders(
    order_id INT primary key,
    customer_id INT NOT NULL,
    order_amount DECIMAL(10,2),
    order_date DATETIME
);
drop table if exists tutorial;
create table customers(
    customer_id INT NOT NULL,
    customer_name VARCHAR(100),
    city VARCHAR(100)
);

-- Insert values into the orders table
INSERT INTO orders (order_id, customer_id, order_amount, order_date)
VALUES
(101, 1, 5000.00, '2025-01-01'),
(102, 2, 10000.00, '2025-01-02'),
(103, 3, 3000.00, '2025-01-03'),
(104, 4, 1500.00, '2025-01-04'),
(105, 1, 7000.00, '2025-01-05'),
(106, 5, 8000.00, '2025-01-06');

-- Insert data into the customers table
INSERT INTO customers (customer_id, customer_name, city)
VALUES
(1, 'Ravi Kumar', 'Chennai'),
(2, 'Priya Sharma', 'Bangalore'),
(3, 'Arjun Mehta', 'Hyderabad'),
(4, 'Meena Gupta', 'Mumbai'),
(5, 'Karthik Raj', 'Chennai');

select * from orders;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
6 rows affected.
5 rows affected.
6 rows affected.

[(101, 1, Decimal('5000.00'), datetime.datetime(2025, 1, 1, 0, 0)),
 (102, 2, Decimal('10000.00'), datetime.datetime(2025, 1, 2, 0, 0)),
 (103, 3, Decimal('3000.00'), datetime.datetime(2025, 1, 3, 0, 0)),
 (104, 4, Decimal('1500.00'), datetime.datetime(2025, 1, 4, 0, 0)),
 (105, 1, Decimal('7000.00'), datetime.datetime(2025, 1, 5, 0, 0)),
 (106, 5, Decimal('8000.00'), datetime.datetime(2025, 1, 6, 0, 0))]

In [16]:
%%sql
select * from customers;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(1, 'Ravi Kumar', 'Chennai'),
 (2, 'Priya Sharma', 'Bangalore'),
 (3, 'Arjun Mehta', 'Hyderabad'),
 (4, 'Meena Gupta', 'Mumbai'),
 (5, 'Karthik Raj', 'Chennai')]

In [17]:
%%sql
select
customer_name,
(select max(order_amount) from orders) as max_order_amount

from customers

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('Ravi Kumar', Decimal('10000.00')),
 ('Priya Sharma', Decimal('10000.00')),
 ('Arjun Mehta', Decimal('10000.00')),
 ('Meena Gupta', Decimal('10000.00')),
 ('Karthik Raj', Decimal('10000.00'))]

Sub queries using WHERE

In [22]:
%%sql
select customer_name
from customers
where customer_id IN (
    SELECT DISTINCT customer_id
    from orders
where order_amount >= 5000
);

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[('Ravi Kumar',), ('Priya Sharma',), ('Karthik Raj',)]

DISTINCT USED

In [26]:
%%sql
SELECT DISTINCT customer_id
    from orders
where order_amount >= 5000

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[(1,), (2,), (5,)]

where true/false decided by EXISTS
if the column exists in the table then it returns true else false

Here condition is true

In [31]:
%%sql
select customer_name
from customers
where EXISTS (
    SELECT * FROM customers where city='Chennai'
);

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('Ravi Kumar',),
 ('Priya Sharma',),
 ('Arjun Mehta',),
 ('Meena Gupta',),
 ('Karthik Raj',)]

Here condition is false

In [34]:
%%sql
select customer_name
from customers
where EXISTS (
    SELECT * FROM customers where city='Karur'
);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [35]:
%%sql
select 
customer_name,
city,
(select sum(order_amount)
from Orders o
where o.customer_id = c.customer_id) as total_orders
from customers c;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('Ravi Kumar', 'Chennai', Decimal('12000.00')),
 ('Priya Sharma', 'Bangalore', Decimal('10000.00')),
 ('Arjun Mehta', 'Hyderabad', Decimal('3000.00')),
 ('Meena Gupta', 'Mumbai', Decimal('1500.00')),
 ('Karthik Raj', 'Chennai', Decimal('8000.00'))]

In [36]:
%%sql
-- Create the table
drop table if exists customer_details;
CREATE TABLE customer_details (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    email VARCHAR(100),
    city VARCHAR(50),
    phone_number VARCHAR(15)
);

-- Insert data into the table
INSERT INTO customer_details (id, customer_name, email, city, phone_number)
VALUES
(1, 'Ravi Kumar', 'ravi.kumar@example.com', 'Chennai', '43210'),
(2, 'Priya Sharma', 'priya.sharma@example.com', 'Bangalore', '43211'),
(3, 'Arjun Mehta', 'arjun.mehta@example.com', 'Hyderabad', '43212'),
(4, 'Meena Gupta', 'meena.gupta@example.com', 'Mumbai', NULL),
(5, 'Karthik Raj', 'karthik.raj@example.com', 'Chennai', '43213');

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
5 rows affected.

[]

FROM takes the select statement as a table

Every derived table must be named

In [39]:
%%sql

select 
    Name_length,
    City_upper,
    name_prefix,
    TRIM,
    Leftt_padded,
    position_of_a

from(
    select length (customer_name) as Name_length,
    upper(city) as City_upper,
    lower(customer_name) as cust_lower,
    concat (customer_name,city) as nameC,
    concat (customer_name,'-',city) as name_C,
    substring(customer_name,1,6) as name_prefix,
    TRIM(customer_name) as trimmed_name,
    TRIM('   dummy   ') as TRIM,
    LTRIM('  dummy') as Left_TRIM,
    RTRIM('dummy   ') as Right_TRIM,
    LPAD(customer_name,15,'*') as Leftt_padded,
    RPAD(customer_name,15,'*') as Right_padded,
    REPLACE(customer_name,' ','-') as updated_name,
    LEFT(customer_name,5) as from_left,
    RIGHT(customer_name,5) as from_right,
    INSTR(customer_name,'a') as position_of_a,
    REVERSE(customer_name) as reversed_name,
    FORMAT(987654321,2) AS formated_date
from customer_details) as subquery

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(10, 'CHENNAI'),
 (12, 'BANGALORE'),
 (11, 'HYDERABAD'),
 (11, 'MUMBAI'),
 (11, 'CHENNAI')]

Sub query in case

In [54]:
%%sql
select
customer_name,
case
when (select sum(order_amount) from Orders where Orders.customer_id = Customers.customer_id)>
(select avg(order_amount) from Orders) then 'Above Average'
else 'Below Average'
END AS order_category
from customers;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('Ravi Kumar', 'Above Average'),
 ('Priya Sharma', 'Above Average'),
 ('Arjun Mehta', 'Below Average'),
 ('Meena Gupta', 'Below Average'),
 ('Karthik Raj', 'Above Average')]